trefeon/excavator-rental-timer/firmware/wifi_master_esp32_WEBUI/main.cpp
/*
 * Excavator Rental Timer - Wi-Fi Master (ESP-NOW Gateway)
 * 
 * Architecture:
 * - Acts as an Access Point (SSID: ExcavatorMaster) for Android App
 * - Uses ESP-NOW to communicate with Slave devices (no Wi-Fi connection needed)
 * - Android App connects via Wi-Fi and uses HTTP API (unchanged)
 * - Master translates HTTP commands to ESP-NOW packets for slaves
 * - Registry logic (MAC -> ID mapping) stored in Preferences
 * - DNSServer captive portal keeps Android Wi-Fi connection stable
 */

#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <Preferences.h>
#include <SPIFFS.h>
#include <ArduinoJson.h>
#include <DNSServer.h>
#include "index_html.h"

#include <esp_idf_version.h>
#include <freertos/semphr.h>
#include <esp_task_wdt.h>
#include <esp_wifi.h>
#include <esp_now.h>

#include "esp_now_protocol.h"

// ===== CONFIG =====
#define DEMO_MODE 0
static const char* AP_SSID = "ExcavatorMaster";
static const char* AP_PASS = "12345678";

WebServer server(80);
Preferences preferences;
SemaphoreHandle_t slavesMutex = NULL;

// ===== TIMING =====
static const uint32_t ONLINE_THRESHOLD_MS = 30000;
static const uint32_t MUTEX_TIMEOUT_TICKS = pdMS_TO_TICKS(500);
static const uint32_t CMD_RESPONSE_TIMEOUT_MS = 2000;

// ===== DNS =====
const byte DNS_PORT = 53;
DNSServer dnsServer;

// ===== LED =====
#define LED_PIN 2

void addCorsHeaders();
void handleOptions();

uint32_t ledOffTime = 0;

void netLedFlash(int ms = 50) {
  digitalWrite(LED_PIN, HIGH);  // ON (Standard ESP32 is Active High)
  ledOffTime = millis() + ms;
}

void updateLed() {
  if (ledOffTime > 0 && millis() >= ledOffTime) {
    digitalWrite(LED_PIN, LOW); // OFF
    ledOffTime = 0;
  }
}

// ===== SLAVE REGISTRY =====
struct SlaveRecord {
  String mac;
  int id;
  String ip;         // empty for ESP-NOW slaves, kept for API compatibility
  uint32_t lastSeen;
  String state;      // "RUNNING", "LOCKED", "PAUSED", "ENDED"
  int time_left;
  String battery;
  uint8_t rawMac[6]; // raw MAC bytes for ESP-NOW addressing
};
SlaveRecord slaves[50];
int slaveCount = 0;

// ===== COMMAND RESPONSE SYNCHRONIZATION =====
// Used to wait for a slave's ESP-NOW response after sending a command
SemaphoreHandle_t cmdResponseSem = NULL;
volatile bool cmdResponseReceived = false;
EspNowPacket cmdResponsePkt;
portMUX_TYPE cmdResponseMux = portMUX_INITIALIZER_UNLOCKED;

// ===== HELPERS =====
void addCorsHeaders() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
  server.sendHeader("Access-Control-Allow-Headers", "Content-Type, X-Admin-User, X-Admin-Pass");
}

void handleOptions() {
  addCorsHeaders();
  server.send(204);
}

String getMacKey(const String& m) {
  String k = m;
  k.replace(":", "");
  return k;
}

String macToString(const uint8_t* mac) {
  char buf[18];
  snprintf(buf, sizeof(buf), "%02X:%02X:%02X:%02X:%02X:%02X",
           mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  return String(buf);
}

bool isValidMac(const String& mac) {
  if (mac.length() != 17) return false;
  for (int i = 0; i < 17; i++) {
    char c = mac.charAt(i);
    if (i % 3 == 2) {
      if (c != ':') return false;
    } else {
      if (!((c >= '0' && c <= '9') || (c >= 'A' && c <= 'F') || (c >= 'a' && c <= 'f'))) return false;
    }
  }
  return true;
}

// ===== REGISTRY LOGIC =====
// Assigns an ID for a given MAC address. Returns the assigned ID (or 0 if full).
int assignIdForMac(const String& mac) {
  int assignedId = 0;

  // Check if already in Preferences
  preferences.begin("registry", false);
  assignedId = preferences.getInt(getMacKey(mac).c_str(), 0);
  preferences.end();

  if (assignedId == 0) {
    // Find next free ID
    preferences.begin("id_map", false);
    for (int i = 1; i <= 50; i++) {
      String existingMac = preferences.getString(String(i).c_str(), "");
      if (existingMac == "") {
        assignedId = i;
        preferences.putString(String(i).c_str(), mac);
        break;
      }
    }
    preferences.end();

    if (assignedId > 0) {
      preferences.begin("registry", false);
      preferences.putInt(getMacKey(mac).c_str(), assignedId);
      preferences.end();
      Serial.printf("[REGISTRY] New Slave registered. MAC: %s assigned ID: EXC-%02d\n", mac.c_str(), assignedId);
    } else {
      Serial.println("[REGISTRY] ERROR: No free IDs available!");
    }
  } else {
    Serial.printf("[REGISTRY] Known Slave returning from Flash. MAC: %s loaded ID: EXC-%02d\n", mac.c_str(), assignedId);
  }

  return assignedId;
}

// Add or update slave in the in-memory array
void upsertSlave(const String& mac, int id, const uint8_t* rawMac) {
  // Check if already exists
  for (int i = 0; i < slaveCount; i++) {
    if (slaves[i].mac == mac) {
      slaves[i].id = id;
      slaves[i].lastSeen = millis();
      memcpy(slaves[i].rawMac, rawMac, 6);
      return;
    }
  }
  // Add new
  if (slaveCount < 50) {
    slaves[slaveCount].mac = mac;
    slaves[slaveCount].id = id;
    slaves[slaveCount].ip = "";  // ESP-NOW slaves don't have IPs
    slaves[slaveCount].lastSeen = millis();
    slaves[slaveCount].state = "LOCKED";
    slaves[slaveCount].time_left = 0;
    slaves[slaveCount].battery = "OK";
    memcpy(slaves[slaveCount].rawMac, rawMac, 6);
    slaveCount++;
  }
}

// ===== ESP-NOW RECEIVE CALLBACK =====
// Note: ESP32 standard (IDF v4) uses the old callback signature.
// ESP32-C3 (IDF v5) uses esp_now_recv_info_t. We handle both via macro.
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
void onEspNowRecv(const esp_now_recv_info_t* info, const uint8_t* data, int len) {
  const uint8_t* mac_addr = info->src_addr;
#else
void onEspNowRecv(const uint8_t* mac_addr, const uint8_t* data, int len) {
#endif
  if (len != sizeof(EspNowPacket)) return;

  EspNowPacket pkt;
  memcpy(&pkt, data, sizeof(EspNowPacket));

  String senderMac = macToString(pkt.mac);

  switch (pkt.type) {
    case PKT_REGISTER_REQ: {
      Serial.printf("[ESPNOW] Registration request from MAC: %s\n", senderMac.c_str());

      int assignedId = 0;
      if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
        assignedId = assignIdForMac(senderMac);
        if (assignedId > 0) {
          upsertSlave(senderMac, assignedId, pkt.mac);
        }
        xSemaphoreGive(slavesMutex);
      }

      // Send registration response
      EspNowPacket resp;
      memset(&resp, 0, sizeof(resp));
      resp.type = PKT_REGISTER_RESP;
      resp.targetId = assignedId;
      resp.senderId = 0; // Master
      memcpy(resp.mac, pkt.mac, 6);

      esp_now_send(ESPNOW_BROADCAST, (uint8_t*)&resp, sizeof(resp));
      Serial.printf("[ESPNOW] Sent registration response: ID=%d to %s\n", assignedId, senderMac.c_str());
      break;
    }

    case PKT_HEARTBEAT: {
      if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
        bool found = false;
        for (int i = 0; i < slaveCount; i++) {
          if (slaves[i].mac == senderMac) {
            found = true;
            slaves[i].state = pktStateName(pkt.state);
            slaves[i].time_left = pkt.timeLeft;
            slaves[i].battery = "OK";
            slaves[i].lastSeen = millis();

            // Check if slave's ID is out of sync (e.g., after edit_slave)
            if (pkt.senderId != (uint8_t)slaves[i].id) {
              Serial.printf("[ESPNOW] Slave %s has stale ID %d, correcting to %d\n",
                            senderMac.c_str(), pkt.senderId, slaves[i].id);
              // Send correction
              EspNowPacket corr;
              memset(&corr, 0, sizeof(corr));
              corr.type = PKT_REGISTER_RESP;
              corr.targetId = slaves[i].id;
              memcpy(corr.mac, pkt.mac, 6);
              esp_now_send(ESPNOW_BROADCAST, (uint8_t*)&corr, sizeof(corr));
            }
            break;
          }
        }

        // Unknown MAC sending heartbeats — auto-register from Preferences
        // This handles Master reboot: slave is still heartbeating but Master
        // lost its in-memory array. The Preferences (flash) still has the MAC→ID mapping.
        if (!found) {
          Serial.printf("[ESPNOW] Heartbeat from unknown MAC %s — auto-registering\n", senderMac.c_str());
          int assignedId = assignIdForMac(senderMac);
          if (assignedId > 0) {
            upsertSlave(senderMac, assignedId, pkt.mac);
            // Update state from heartbeat data
            for (int i = 0; i < slaveCount; i++) {
              if (slaves[i].mac == senderMac) {
                slaves[i].state = pktStateName(pkt.state);
                slaves[i].time_left = pkt.timeLeft;
                slaves[i].lastSeen = millis();
                break;
              }
            }
            // Send registration response so slave knows it's recognized
            EspNowPacket resp;
            memset(&resp, 0, sizeof(resp));
            resp.type = PKT_REGISTER_RESP;
            resp.targetId = assignedId;
            memcpy(resp.mac, pkt.mac, 6);
            esp_now_send(ESPNOW_BROADCAST, (uint8_t*)&resp, sizeof(resp));
          }
        }

        xSemaphoreGive(slavesMutex);
      }
      break;
    }

