trefeon/excavator-rental-timer/firmware/wifi_master_esp32_WEBUI/main.cpp
    case PKT_COMMAND_RESP: {
      // Store the response and signal the waiting HTTP handler
      portENTER_CRITICAL(&cmdResponseMux);
      memcpy(&cmdResponsePkt, &pkt, sizeof(pkt));
      cmdResponseReceived = true;
      portEXIT_CRITICAL(&cmdResponseMux);

      if (cmdResponseSem) {
        xSemaphoreGive(cmdResponseSem);
      }

      // Also update the slave cache
      if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
        for (int i = 0; i < slaveCount; i++) {
          if (slaves[i].mac == senderMac) {
            slaves[i].state = pktStateName(pkt.state);
            slaves[i].time_left = pkt.timeLeft;
            slaves[i].lastSeen = millis();
            break;
          }
        }
        xSemaphoreGive(slavesMutex);
      }
      break;
    }

    default:
      Serial.printf("[ESPNOW] Unknown packet type: %d\n", pkt.type);
      break;
  }
}

// ===== SPIFFS HELPERS =====
JsonDocument loadJsonFile(const char* path) {
  JsonDocument doc;
  File file = SPIFFS.open(path, "r");
  if (!file) return doc;
  deserializeJson(doc, file);
  file.close();
  return doc;
}

void saveJsonFile(const char* path, const JsonDocument& doc) {
  File file = SPIFFS.open(path, "w");
  if (!file) return;
  serializeJson(doc, file);
  file.close();
}

bool authCheck(bool requireSA = false) {
  String u = server.header("X-Admin-User");
  String p = server.header("X-Admin-Pass");
  if (u == "" || p == "") return false;

  JsonDocument auth = loadJsonFile("/auth.json");
  
  if (auth["sa"]["user"] == u && auth["sa"]["pass"] == p) {
    return true; // SuperAdmin has access to everything
  }
  
  if (!requireSA) {
    JsonArray kr = auth["kr"].as<JsonArray>();
    for (JsonObject k : kr) {
      if (k["user"] == u && k["pass"] == p) return true;
    }
  }
  
  return false;
}

// ===== HTTP HANDLERS =====

// GET /api/auth — check if SA exists
void handleCheckAuth() {
  addCorsHeaders();
  JsonDocument auth = loadJsonFile("/auth.json");
  bool exists = !auth["sa"]["user"].isNull();
  server.send(200, "application/json", "{\"exists\":" + String(exists ? "true" : "false") + "}");
}

// POST /api/auth/register — register SA (only if not exists)
void handleRegisterSA() {
  addCorsHeaders();
  if (!server.hasArg("plain")) { server.send(400); return; }
  JsonDocument doc; deserializeJson(doc, server.arg("plain"));
  String u = doc["username"] | "";
  String p = doc["password"] | "";
  if (u == "" || p.length() < 4) { server.send(400, "application/json", "{\"ok\":0}"); return; }

  JsonDocument auth = loadJsonFile("/auth.json");
  if (!auth["sa"]["user"].isNull()) {
    server.send(400, "application/json", "{\"ok\":0,\"code\":\"ALREADY_EXISTS\"}"); return;
  }

  auth["sa"]["user"] = u;
  auth["sa"]["pass"] = p;
  if (auth["kr"].isNull()) auth["kr"] = JsonArray();
  saveJsonFile("/auth.json", auth);
  server.send(200, "application/json", "{\"ok\":1}");
}

// POST /api/auth/login — return role
void handleLogin() {
  addCorsHeaders();
  if (!server.hasArg("plain")) { server.send(400); return; }
  JsonDocument doc; deserializeJson(doc, server.arg("plain"));
  String u = doc["username"] | "";
  String p = doc["password"] | "";

  JsonDocument auth = loadJsonFile("/auth.json");
  if (auth["sa"]["user"] == u && auth["sa"]["pass"] == p) {
    server.send(200, "application/json", "{\"ok\":1,\"role\":\"sa\"}"); return;
  }

  JsonArray kr = auth["kr"].as<JsonArray>();
  for (JsonObject k : kr) {
    if (k["user"] == u && k["pass"] == p) {
      server.send(200, "application/json", "{\"ok\":1,\"role\":\"kr\"}"); return;
    }
  }
  server.send(400, "application/json", "{\"ok\":0}");
}

// POST /api/auth/change-pass
void handleChangePass() {
  addCorsHeaders();
  if (!authCheck()) { server.send(401); return; }
  if (!server.hasArg("plain")) { server.send(400); return; }
  JsonDocument doc; deserializeJson(doc, server.arg("plain"));
  String u = doc["username"] | "";
  String oldP = doc["oldPass"] | "";
  String newP = doc["newPass"] | "";

  JsonDocument auth = loadJsonFile("/auth.json");
  if (auth["sa"]["user"] == u && auth["sa"]["pass"] == oldP) {
    auth["sa"]["pass"] = newP;
    saveJsonFile("/auth.json", auth);
    server.send(200, "application/json", "{\"ok\":1}"); return;
  }

  JsonArray kr = auth["kr"].as<JsonArray>();
  for (JsonObject k : kr) {
    if (k["user"] == u && k["pass"] == oldP) {
      k["pass"] = newP;
      saveJsonFile("/auth.json", auth);
      server.send(200, "application/json", "{\"ok\":1}"); return;
    }
  }
  server.send(400, "application/json", "{\"ok\":0}");
}

// GET /api/karyawan
void handleGetKaryawan() {
  addCorsHeaders();
  if (!authCheck(true)) { server.send(401); return; } // SA only
  JsonDocument auth = loadJsonFile("/auth.json");
  JsonDocument res;
  JsonArray resArr = res["karyawan"].to<JsonArray>();
  JsonArray kr = auth["kr"].as<JsonArray>();
  for (JsonObject k : kr) {
    resArr.add(k["user"]);
  }
  String out; serializeJson(res, out);
  server.send(200, "application/json", out);
}

// POST /api/karyawan/add
void handleAddKaryawan() {
  addCorsHeaders();
  if (!authCheck(true)) { server.send(401); return; } // SA only
  if (!server.hasArg("plain")) { server.send(400); return; }
  JsonDocument doc; deserializeJson(doc, server.arg("plain"));
  String u = doc["username"] | "";
  String p = doc["password"] | "";
  if (u == "" || p.length() < 4) { server.send(400, "application/json", "{\"ok\":0}"); return; }

  JsonDocument auth = loadJsonFile("/auth.json");
  if (auth["sa"]["user"] == u) { server.send(400, "application/json", "{\"ok\":0,\"code\":\"ALREADY_EXISTS\"}"); return; }
  
  JsonArray kr = auth["kr"].as<JsonArray>();
  if (!kr) kr = auth["kr"].to<JsonArray>();
  for (JsonObject k : kr) {
    if (k["user"] == u) { server.send(400, "application/json", "{\"ok\":0,\"code\":\"ALREADY_EXISTS\"}"); return; }
  }

  JsonObject newKr = kr.add<JsonObject>();
  newKr["user"] = u;
  newKr["pass"] = p;
  saveJsonFile("/auth.json", auth);
  server.send(200, "application/json", "{\"ok\":1}");
}

// POST /api/karyawan/delete
void handleDeleteKaryawan() {
  addCorsHeaders();
  if (!authCheck(true)) { server.send(401); return; } // SA only
  if (!server.hasArg("plain")) { server.send(400); return; }
  JsonDocument doc; deserializeJson(doc, server.arg("plain"));
  String u = doc["username"] | "";

  JsonDocument auth = loadJsonFile("/auth.json");
  JsonArray kr = auth["kr"].as<JsonArray>();
  for (int i = 0; i < kr.size(); i++) {
    if (kr[i]["user"] == u) {
      kr.remove(i);
      saveJsonFile("/auth.json", auth);
      server.send(200, "application/json", "{\"ok\":1}"); return;
    }
  }
  server.send(400, "application/json", "{\"ok\":0}");
}

// GET /api/stats
void handleGetStats() {
  addCorsHeaders();
  if (!authCheck(false)) { server.send(401); return; }
  JsonDocument stats = loadJsonFile("/stats.json");
  String out; serializeJson(stats, out);
  server.send(200, "application/json", out);
}

// POST /api/stats/add
void handleAddStats() {
  addCorsHeaders();
  if (!authCheck(false)) { server.send(401); return; }
  if (!server.hasArg("plain")) { server.send(400); return; }
  JsonDocument doc; deserializeJson(doc, server.arg("plain"));
  String id = doc["id"] | "";
  int detik = doc["detik"] | 0;
  if (id == "" || detik <= 0) { server.send(400, "application/json", "{\"ok\":0}"); return; }

  JsonDocument stats = loadJsonFile("/stats.json");
  if (stats[id].isNull()) {
    stats[id]["totalDetik"] = 0;
    stats[id]["totalSesi"] = 0;
  }
  stats[id]["totalDetik"] = stats[id]["totalDetik"].as<int>() + detik;
  stats[id]["totalSesi"] = stats[id]["totalSesi"].as<int>() + 1;
  saveJsonFile("/stats.json", stats);
  server.send(200, "application/json", "{\"ok\":1}");
}

// POST /api/stats/reset
void handleResetStats() {
  addCorsHeaders();
  if (!authCheck(true)) { server.send(401); return; } // SA only
  if (!server.hasArg("plain")) { server.send(400); return; }
  JsonDocument doc; deserializeJson(doc, server.arg("plain"));
  String id = doc["id"] | "";
  if (id == "") { server.send(400, "application/json", "{\"ok\":0}"); return; }

  JsonDocument stats = loadJsonFile("/stats.json");
  stats[id]["totalDetik"] = 0;
  stats[id]["totalSesi"] = 0;
  saveJsonFile("/stats.json", stats);
  server.send(200, "application/json", "{\"ok\":1}");
}

// GET /api/slaves — List all slave units (unchanged API)
void handleSlaves() {
  addCorsHeaders();

  JsonDocument doc;
  JsonArray array = doc.to<JsonArray>();
  uint32_t now = millis();

  if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
    for (int i = 0; i < slaveCount; i++) {
      JsonObject obj = array.add<JsonObject>();
      obj["id"] = slaves[i].id;
      obj["ip"] = slaves[i].ip;
      obj["mac"] = slaves[i].mac;
      obj["online"] = (now - slaves[i].lastSeen) < ONLINE_THRESHOLD_MS;
      obj["state"] = slaves[i].state;
      obj["time_left"] = slaves[i].time_left;
      obj["battery"] = slaves[i].battery;
    }
    xSemaphoreGive(slavesMutex);
  }

  String json;
  serializeJson(doc, json);
  server.send(200, "application/json", json);
}

// POST /api/command — Send command to slave via ESP-NOW (same API contract)
void handleCommandProxy() {
  addCorsHeaders();
  if (!server.hasArg("plain")) {
    server.send(400);
    return;
  }
  String body = server.arg("plain");

  JsonDocument doc;
  if (deserializeJson(doc, body)) {
    server.send(400, "application/json", "{\"ok\":0,\"error\":\"Invalid JSON\"}");
    return;
  }
  int targetId = doc["id"] | 0;
  String cmdStr = doc["cmd"] | "";
  int time = doc["time"] | 0;
  if (time < 0) time = 0;

  if (targetId <= 0 || cmdStr == "") {
    Serial.println("[PROXY] Command failed: Missing id or cmd");
    server.send(400, "application/json", "{\"ok\":0,\"error\":\"Missing id or cmd\"}");
    return;
  }

  cmdStr.toUpperCase();
  CmdType cmdEnum = cmdFromString(cmdStr.c_str());
  if (cmdEnum == CMD_NONE) {
    server.send(400, "application/json", "{\"ok\":0,\"error\":\"Unknown command\"}");
    return;
  }

  Serial.printf("[PROXY] Command '%s' (time: %d) for EXC-%02d\n", cmdStr.c_str(), time, targetId);
  netLedFlash(80);

  // Check slave exists
  bool found = false;
  int slaveIdx = -1;
  String targetMac = "";
  if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
    for (int i = 0; i < slaveCount; i++) {
      if (slaves[i].id == targetId) {
        found = true;
        slaveIdx = i;
        targetMac = slaves[i].mac;
        break;
      }
    }
    xSemaphoreGive(slavesMutex);
  }

