trefeon/excavator-rental-timer/firmware/wifi_master_esp32_WEBUI/main.cpp
  if (!found) {
    Serial.printf("[PROXY] Failed: Slave EXC-%02d not found in registry\n", targetId);
    server.send(404, "application/json", "{\"ok\":0,\"error\":\"Slave not found\"}");
    return;
  }

#if DEMO_MODE
  if (targetMac.startsWith("FF:FF:FF:00:00:")) {
    if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
      if (cmdEnum == CMD_ADD_TIME) {
        slaves[slaveIdx].time_left += time;
        if (slaves[slaveIdx].state == "LOCKED" || slaves[slaveIdx].state == "ENDED") {
          slaves[slaveIdx].state = "RUNNING";
        }
      } else if (cmdEnum == CMD_PAUSE) {
        slaves[slaveIdx].state = "PAUSED";
      } else if (cmdEnum == CMD_RESUME) {
        if (slaves[slaveIdx].time_left > 0) {
          slaves[slaveIdx].state = "RUNNING";
        }
      } else if (cmdEnum == CMD_STOP) {
        slaves[slaveIdx].state = "ENDED";
        slaves[slaveIdx].time_left = 0;
      }
      slaves[slaveIdx].lastSeen = millis();
      char resp[128];
      snprintf(resp, sizeof(resp), "{\"ok\":1,\"code\":\"OK\",\"time_left\":%d,\"state\":\"%s\"}", slaves[slaveIdx].time_left, slaves[slaveIdx].state.c_str());
      server.send(200, "application/json", String(resp));
      xSemaphoreGive(slavesMutex);
    } else {
      server.send(503, "application/json", "{\"ok\":0,\"error\":\"Mutex timeout\"}");
    }
    return;
  }
#endif

  // Build ESP-NOW command packet
  EspNowPacket pkt;
  memset(&pkt, 0, sizeof(pkt));
  pkt.type = PKT_COMMAND;
  pkt.targetId = targetId;
  pkt.senderId = 0; // Master
  pkt.cmd = cmdEnum;
  pkt.value = time;

  // Reset response state
  portENTER_CRITICAL(&cmdResponseMux);
  cmdResponseReceived = false;
  portEXIT_CRITICAL(&cmdResponseMux);

  // Drain any stale semaphore tokens from late responses
  while(xSemaphoreTake(cmdResponseSem, 0) == pdTRUE) {}

  // Broadcast the command
  esp_err_t result = esp_now_send(ESPNOW_BROADCAST, (uint8_t*)&pkt, sizeof(pkt));
  if (result != ESP_OK) {
    Serial.printf("[PROXY] ESP-NOW send failed: %d\n", result);
    server.send(502, "application/json", "{\"ok\":0,\"error\":\"Radio send failed\"}");
    return;
  }

  // Wait for response from slave
  bool gotResponse = false;
  if (xSemaphoreTake(cmdResponseSem, pdMS_TO_TICKS(CMD_RESPONSE_TIMEOUT_MS)) == pdTRUE) {
    portENTER_CRITICAL(&cmdResponseMux);
    gotResponse = cmdResponseReceived;
    portEXIT_CRITICAL(&cmdResponseMux);
  }

  if (gotResponse && cmdResponsePkt.senderId == (uint8_t)targetId) {
    // Build JSON response matching the API spec exactly
    char resp[128];
    snprintf(resp, sizeof(resp),
             "{\"ok\":%d,\"code\":\"%s\",\"time_left\":%lu,\"state\":\"%s\"}",
             (cmdResponsePkt.respCode == RESP_OK || cmdResponsePkt.respCode == RESP_REBOOTING) ? 1 : 0,
             respCodeName(cmdResponsePkt.respCode),
             (unsigned long)cmdResponsePkt.timeLeft,
             pktStateName(cmdResponsePkt.state));
    Serial.printf("[PROXY] Slave responded: %s\n", resp);
    server.send(200, "application/json", String(resp));
  } else {
    Serial.printf("[PROXY] Slave EXC-%02d timeout (no ESP-NOW response)\n", targetId);
    server.send(502, "application/json", "{\"ok\":0,\"error\":\"Slave offline/timeout\"}");
  }
}

// POST /api/edit_slave — Change slave ID (unchanged logic)
void handleEditSlave() {
  addCorsHeaders();
  if (!server.hasArg("plain")) {
    server.send(400);
    return;
  }
  String body = server.arg("plain");

  JsonDocument doc;
  if (deserializeJson(doc, body)) {
    server.send(400, "application/json", "{\"ok\":0}");
    return;
  }
  String mac = doc["mac"] | "";
  int newId = doc["id"] | 0;

  if (mac == "" || !isValidMac(mac) || newId <= 0) {
    Serial.println("[MANAGE] Edit ID failed: Invalid MAC or ID");
    server.send(400, "application/json", "{\"ok\":0}");
    return;
  }

  Serial.printf("[MANAGE] Changing ID for MAC %s to EXC-%02d\n", mac.c_str(), newId);

  preferences.begin("id_map", false);
  String owner = preferences.getString(String(newId).c_str(), "");
  if (owner != "" && owner != mac) {
    preferences.end();
    Serial.println("[MANAGE] Edit ID failed: ID already taken");
    server.send(400, "application/json", "{\"ok\":0,\"error\":\"ID Taken\"}");
    return;
  }
  preferences.end();

  int oldId = 0;
  preferences.begin("registry", false);
  oldId = preferences.getInt(getMacKey(mac).c_str(), 0);
  preferences.putInt(getMacKey(mac).c_str(), newId);
  preferences.end();

  preferences.begin("id_map", false);
  if (oldId > 0 && oldId != newId) {
    preferences.remove(String(oldId).c_str());
  }
  preferences.putString(String(newId).c_str(), mac);
  preferences.end();

  if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
    for (int i = 0; i < slaveCount; i++) {
      if (slaves[i].mac == mac) {
        slaves[i].id = newId;
        break;
      }
    }
    xSemaphoreGive(slavesMutex);
  }
  server.send(200, "application/json", "{\"ok\":1}");
}

// POST /api/delete_slave — Delete slave from registry (unchanged logic)
void handleDeleteSlave() {
  addCorsHeaders();
  if (!server.hasArg("plain")) {
    server.send(400);
    return;
  }
  String body = server.arg("plain");
  JsonDocument doc;
  if (deserializeJson(doc, body)) {
    server.send(400, "application/json", "{\"ok\":0}");
    return;
  }
  String mac = doc["mac"] | "";

  if (mac == "" || !isValidMac(mac)) {
    Serial.println("[MANAGE] Delete Slave failed: Invalid MAC");
    server.send(400, "application/json", "{\"ok\":0}");
    return;
  }

  Serial.printf("[MANAGE] Deleting Slave MAC %s from registry\n", mac.c_str());
  preferences.begin("registry", false);
  int deletedId = preferences.getInt(getMacKey(mac).c_str(), 0);
  preferences.remove(getMacKey(mac).c_str());
  preferences.end();

  if (deletedId > 0) {
    preferences.begin("id_map", false);
    preferences.remove(String(deletedId).c_str());
    preferences.end();
  }

  if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
    for (int i = 0; i < slaveCount; i++) {
      if (slaves[i].mac == mac) {
        for (int j = i; j < slaveCount - 1; j++) {
          slaves[j] = slaves[j + 1];
        }
        slaveCount--;
        break;
      }
    }
    xSemaphoreGive(slavesMutex);
  }
  server.send(200, "application/json", "{\"ok\":1}");
}

// POST /api/reset_registry — Wipes all MAC-to-ID mappings in memory and flash
void handleResetRegistry() {
  addCorsHeaders();

  Serial.println("[MANAGE] FACTORY RESET: Wiping slave registry...");

