trefeon/excavator-rental-timer/firmware/wifi_master_esp32_WEBUI/main.cpp
  // Wipe flash
  preferences.begin("registry", false);
  preferences.clear();
  preferences.end();

  preferences.begin("id_map", false);
  preferences.clear();
  preferences.end();

  // Wipe memory
  if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
    slaveCount = 0;
    xSemaphoreGive(slavesMutex);
  }

  server.send(200, "application/json", "{\"ok\":1,\"message\":\"Registry wiped. Restart Slaves to re-register.\"}");
  netLedFlash(500); // long flash
}

// GET /api/register — Kept for backward compatibility with HTTP-based slaves
void handleRegister() {
  addCorsHeaders();
  String mac = server.arg("mac");
  if (mac == "") {
    server.send(400, "application/json", "{\"error\":\"MAC required\"}");
    return;
  }
  if (!isValidMac(mac)) {
    server.send(400, "application/json", "{\"error\":\"Invalid MAC format\"}");
    return;
  }
  String ip = server.client().remoteIP().toString();

  int assignedId = 0;

  if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) != pdTRUE) {
    server.send(503, "application/json", "{\"error\":\"Server busy\"}");
    return;
  }

  assignedId = assignIdForMac(mac);
  if (assignedId > 0) {
    // For HTTP slaves, we store the IP
    uint8_t dummyMac[6] = {0};
    upsertSlave(mac, assignedId, dummyMac);
    // Update IP for HTTP slaves
    for (int i = 0; i < slaveCount; i++) {
      if (slaves[i].mac == mac) {
        slaves[i].ip = ip;
        slaves[i].lastSeen = millis();
        break;
      }
    }
  }

  xSemaphoreGive(slavesMutex);

  char buf[64];
  snprintf(buf, sizeof(buf), "{\"id\":%d}", assignedId);
  server.send(200, "application/json", String(buf));
  netLedFlash(80);
}

// ===== AP EVENT HANDLER =====
void onApEvent(WiFiEvent_t event, WiFiEventInfo_t info) {
  switch (event) {
    case ARDUINO_EVENT_WIFI_AP_STACONNECTED: {
      uint8_t* mac = info.wifi_ap_staconnected.mac;
      Serial.printf("[AP] Station connected: %02X:%02X:%02X:%02X:%02X:%02X\n",
                    mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
      break;
    }
    case ARDUINO_EVENT_WIFI_AP_STADISCONNECTED: {
      uint8_t* mac = info.wifi_ap_stadisconnected.mac;
      Serial.printf("[AP] Station disconnected: %02X:%02X:%02X:%02X:%02X:%02X\n",
                    mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
      break;
    }
    default:
      break;
  }
}

// ===== SETUP =====
void setup() {
  Serial.begin(115200);
  pinMode(LED_PIN, OUTPUT);
  digitalWrite(LED_PIN, LOW);

  slavesMutex = xSemaphoreCreateMutex();
  cmdResponseSem = xSemaphoreCreateBinary();

#if ESP_IDF_VERSION_MAJOR >= 5
  esp_task_wdt_config_t wdtCfg = {
    .timeout_ms = 10000,
    .idle_core_mask = 0,
    .trigger_panic = true,
  };
  esp_task_wdt_init(&wdtCfg);
#else
  esp_task_wdt_init(10, true);
#endif
  esp_task_wdt_add(NULL);

  Serial.println("Starting Master Access Point (ESP-NOW Gateway)");
  Serial.printf("[BOOT] Free heap: %lu bytes, Min free ever: %lu bytes\n",
                (unsigned long)ESP.getFreeHeap(), (unsigned long)ESP.getMinFreeHeap());

  if (!SPIFFS.begin(true)) {
    Serial.println("[SYSTEM] SPIFFS Mount Failed");
  } else {
    Serial.println("[SYSTEM] SPIFFS Mounted");
  }

  // Wi-Fi: AP+STA mode (AP for Android, STA for ESP-NOW)
  WiFi.mode(WIFI_AP_STA);

  IPAddress apIP(192, 168, 4, 1);
  WiFi.softAPConfig(apIP, apIP, IPAddress(255, 255, 255, 0));
  WiFi.softAP(AP_SSID, AP_PASS, ESPNOW_CHANNEL, 0, 10);
  WiFi.setSleep(false);

  // Wi-Fi optimization
  esp_wifi_set_protocol(WIFI_IF_AP, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N);
  esp_wifi_set_bandwidth(WIFI_IF_AP, WIFI_BW_HT20);
  esp_wifi_set_max_tx_power(84); // 21dBm Max power

  WiFi.onEvent(onApEvent);

  // Captive portal DNS — keeps Android Wi-Fi connected
  dnsServer.start(DNS_PORT, "*", apIP);

  // Initialize ESP-NOW
  if (esp_now_init() != ESP_OK) {
    Serial.println("[ESPNOW] ERROR: Init failed! Rebooting...");
    delay(1000);
    ESP.restart();
  }
  esp_now_register_recv_cb(onEspNowRecv);

  // Add broadcast peer so we can send broadcasts
  esp_now_peer_info_t peerInfo;
  memset(&peerInfo, 0, sizeof(peerInfo));
  memcpy(peerInfo.peer_addr, ESPNOW_BROADCAST, 6);
  peerInfo.channel = 0; // 0 = current channel
  peerInfo.encrypt = false;
  esp_now_add_peer(&peerInfo);

  Serial.println("[ESPNOW] Initialized successfully");

#if DEMO_MODE
  if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
    uint8_t fakeRaws[5][6] = {
      {0xFF, 0xFF, 0xFF, 0x00, 0x00, 0x01},
      {0xFF, 0xFF, 0xFF, 0x00, 0x00, 0x02},
      {0xFF, 0xFF, 0xFF, 0x00, 0x00, 0x03},
      {0xEE, 0xEE, 0xEE, 0x00, 0x00, 0x04},
      {0xEE, 0xEE, 0xEE, 0x00, 0x00, 0x05}
    };
    String fakeMacs[5] = {
      "FF:FF:FF:00:00:01", "FF:FF:FF:00:00:02", "FF:FF:FF:00:00:03",
      "EE:EE:EE:00:00:04", "EE:EE:EE:00:00:05"
    };
    String fakeStates[5] = {"ENDED", "ENDED", "ENDED", "ENDED", "ENDED"};
    int fakeTimes[5] = {0, 0, 0, 0, 0};

    for (int i = 0; i < 5; i++) {
      int assignedId = assignIdForMac(fakeMacs[i]);
      if (assignedId > 0) {
        upsertSlave(fakeMacs[i], assignedId, fakeRaws[i]);
        for(int j = 0; j < slaveCount; j++) {
          if(slaves[j].mac == fakeMacs[i]) {
            slaves[j].state = fakeStates[i];
            slaves[j].time_left = fakeTimes[i];
            // If offline demo unit, reset lastSeen so it instantly shows offline
            if (fakeMacs[i].startsWith("EE:")) {
              slaves[j].lastSeen = 0;
            }
          }
        }
      }
    }
    xSemaphoreGive(slavesMutex);
    Serial.println("[DEMO] Added fake slaves.");
  }
#endif

// HTTP endpoints — identical API surface for Android app


  server.on("/api/register", HTTP_GET, handleRegister);
  server.on("/api/register", HTTP_OPTIONS, handleOptions);
  server.on("/api/slaves", HTTP_GET, handleSlaves);
  server.on("/api/slaves", HTTP_OPTIONS, handleOptions);
  server.on("/api/command", HTTP_POST, handleCommandProxy);
  server.on("/api/command", HTTP_OPTIONS, handleOptions);
  server.on("/api/edit_slave", HTTP_POST, handleEditSlave);
  server.on("/api/edit_slave", HTTP_OPTIONS, handleOptions);
  server.on("/api/delete_slave", HTTP_POST, handleDeleteSlave);
  server.on("/api/delete_slave", HTTP_OPTIONS, handleOptions);
  server.on("/api/reset_registry", HTTP_POST, handleResetRegistry);
  server.on("/api/reset_registry", HTTP_OPTIONS, handleOptions);

  server.on("/api/auth", HTTP_GET, handleCheckAuth);
  server.on("/api/auth", HTTP_OPTIONS, handleOptions);
  server.on("/api/auth/register", HTTP_POST, handleRegisterSA);
  server.on("/api/auth/register", HTTP_OPTIONS, handleOptions);
  server.on("/api/auth/login", HTTP_POST, handleLogin);
  server.on("/api/auth/login", HTTP_OPTIONS, handleOptions);
  server.on("/api/auth/change-pass", HTTP_POST, handleChangePass);
  server.on("/api/auth/change-pass", HTTP_OPTIONS, handleOptions);

