trefeon/excavator-rental-timer/firmware/wifi_master_esp32_WEBUI/main.cpp
  server.on("/api/karyawan", HTTP_GET, handleGetKaryawan);
  server.on("/api/karyawan", HTTP_OPTIONS, handleOptions);
  server.on("/api/karyawan/add", HTTP_POST, handleAddKaryawan);
  server.on("/api/karyawan/add", HTTP_OPTIONS, handleOptions);
  server.on("/api/karyawan/delete", HTTP_POST, handleDeleteKaryawan);
  server.on("/api/karyawan/delete", HTTP_OPTIONS, handleOptions);

  server.on("/api/stats", HTTP_GET, handleGetStats);
  server.on("/api/stats", HTTP_OPTIONS, handleOptions);
  server.on("/api/stats/add", HTTP_POST, handleAddStats);
  server.on("/api/stats/add", HTTP_OPTIONS, handleOptions);
  server.on("/api/stats/reset", HTTP_POST, handleResetStats);
  server.on("/api/stats/reset", HTTP_OPTIONS, handleOptions);

  const char * headerkeys[] = {"X-Admin-User", "X-Admin-Pass"} ;
  size_t headerkeyssize = sizeof(headerkeys)/sizeof(char*);
  server.collectHeaders(headerkeys, headerkeyssize);

  server.on("/", HTTP_GET, []() {
    server.sendHeader("Content-Encoding", "gzip");
    server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
    server.sendHeader("Pragma", "no-cache");
    server.sendHeader("Expires", "-1");
    server.send_P(200, "text/html", (const char*)index_html_gz, sizeof(index_html_gz));
  });

  server.onNotFound([]() {
    if (server.method() == HTTP_OPTIONS) {
      server.sendHeader("Access-Control-Allow-Origin", "*");
      server.sendHeader("Access-Control-Max-Age", "10000");
      server.sendHeader("Access-Control-Allow-Methods", "PUT,POST,GET,OPTIONS");
      server.sendHeader("Access-Control-Allow-Headers", "*");
      server.send(204);
    } else {
      server.sendHeader("Location", "http://192.168.4.1/", true);
      server.send(302, "text/plain", "Redirecting...");
    }
  });

  server.begin();
  Serial.println("Web Server running at http://192.168.4.1/");
  Serial.println("[SYSTEM] Master ready! Android connects via Wi-Fi, Slaves via ESP-NOW.");
}

// ===== LOOP =====
void loop() {
  dnsServer.processNextRequest();
  esp_task_wdt_reset();
  server.handleClient();
  updateLed();

  static uint32_t lastLedBlink = 0;
  static uint32_t lastHb = 0;
  uint32_t now = millis();

  if (now - lastLedBlink >= 3000) {
    lastLedBlink = now;
    netLedFlash(50);
  }

  if (now - lastHb >= 1000) {
    lastHb = now;
    if (xSemaphoreTake(slavesMutex, MUTEX_TIMEOUT_TICKS) == pdTRUE) {
      Serial.printf("[MASTER-HB] up=%lus slaves=%d\n", now / 1000, slaveCount);
#if DEMO_MODE
      for (int i = 0; i < slaveCount; i++) {
        if (slaves[i].mac.startsWith("FF:FF:FF:00:00:")) {
          slaves[i].lastSeen = now;
          if (slaves[i].state == "RUNNING" && slaves[i].time_left > 0) {
            slaves[i].time_left--;
            if (slaves[i].time_left <= 0) {
              slaves[i].state = "ENDED";
            }
          }
        }
      }
#endif
      xSemaphoreGive(slavesMutex);
    }
  }
}
